package Classwork;

import java.util.Scanner;

public class lesson_3 {
    public static void main(String[] args) {
        //String string1 = "Мое имя {name}. Мой возраст {age}. Но чувствую я себя на все {newAge}.";
        //String string2 = string1.replace("{name}", "%s").replace("{age}", "%d")
        //.replace("{newAge}", "%d");
        //System.out.printf(string2, "Сергей", 31, 100);
      /*Пользователь вводит с клавиатуры произвольную строку.
   Необходимо чтобы вместо второго слова введенной строки
   выводилось слово "конечно". И это слово должно писаться отдельной строкой.
   Ну и после добавлялась фраза типа:
   Напечатано сегодня в {день недели вывода этого сообщения}, в {время вывода сообщения формата 22:22}
   . (В верхнем регистре.)
    Scanner input = new Scanner()*/
    }
    }



